patrick11514/VSB/Semester5/OSY/osy-workspace.rtos/tasks/board/pin_mux.c
    gpio_pin_config_t PTC0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(LED_PTC0_GPIO, LED_PTC0_PIN, &PTC0_config);

    gpio_pin_config_t PTC1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(LED_PTC1_GPIO, LED_PTC1_PIN, &PTC1_config);

    gpio_pin_config_t PTC2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(LED_PTC2_GPIO, LED_PTC2_PIN, &PTC2_config);

    gpio_pin_config_t PTC3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(LED_PTC3_GPIO, LED_PTC3_PIN, &PTC3_config);

    gpio_pin_config_t PTC4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 76)  */
    GPIO_PinInit(LED_PTC4_GPIO, LED_PTC4_PIN, &PTC4_config);

    gpio_pin_config_t PTC5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(LED_PTC5_GPIO, LED_PTC5_PIN, &PTC5_config);

    gpio_pin_config_t PTC7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(LED_PTC7_GPIO, LED_PTC7_PIN, &PTC7_config);

    gpio_pin_config_t PTC8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(LED_PTC8_GPIO, LED_PTC8_PIN, &PTC8_config);

    /* PORTA1 (pin 35) is configured as PTA1 */
    PORT_SetPinMux(LED_PTA1_PORT, LED_PTA1_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin 36) is configured as PTA2 */
    PORT_SetPinMux(LED_PTA2_PORT, LED_PTA2_PIN, kPORT_MuxAsGpio);

    /* PORTB10 (pin 58) is configured as PTB10 */
    PORT_SetPinMux(LED_PTB10_PORT, LED_PTB10_PIN, kPORT_MuxAsGpio);

    /* PORTB11 (pin 59) is configured as PTB11 */
    PORT_SetPinMux(LED_PTB11_PORT, LED_PTB11_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 64) is configured as PTB18 */
    PORT_SetPinMux(LED_PTB18_PORT, LED_PTB18_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 65) is configured as PTB19 */
    PORT_SetPinMux(LED_PTB19_PORT, LED_PTB19_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 55) is configured as PTB2 */
    PORT_SetPinMux(LED_PTB2_PORT, LED_PTB2_PIN, kPORT_MuxAsGpio);

    /* PORTB20 (pin 66) is configured as PTB20 */
    PORT_SetPinMux(LED_PTB20_PORT, LED_PTB20_PIN, kPORT_MuxAsGpio);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(LED_PTB23_PORT, LED_PTB23_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 56) is configured as PTB3 */
    PORT_SetPinMux(LED_PTB3_PORT, LED_PTB3_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(LED_PTB9_PORT, LED_PTB9_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(LED_PTC0_PORT, LED_PTC0_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 71) is configured as PTC1 */
    PORT_SetPinMux(LED_PTC1_PORT, LED_PTC1_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 72) is configured as PTC2 */
    PORT_SetPinMux(LED_PTC2_PORT, LED_PTC2_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 73) is configured as PTC3 */
    PORT_SetPinMux(LED_PTC3_PORT, LED_PTC3_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 76) is configured as PTC4 */
    PORT_SetPinMux(LED_PTC4_PORT, LED_PTC4_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 77) is configured as PTC5 */
    PORT_SetPinMux(LED_PTC5_PORT, LED_PTC5_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 79) is configured as PTC7 */
    PORT_SetPinMux(LED_PTC7_PORT, LED_PTC7_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 80) is configured as PTC8 */
    PORT_SetPinMux(LED_PTC8_PORT, LED_PTC8_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
KIT_SW:
- options: {callFromInitBoot: 'true', prefix: SW_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '81', peripheral: GPIOC, signal: 'GPIO, 9', pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/FTM2_FLT0, direction: INPUT, gpio_interrupt: kPORT_InterruptOrDMADisabled,
    pull_select: no_init}
  - {pin_num: '82', peripheral: GPIOC, signal: 'GPIO, 10', pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5, direction: INPUT, gpio_interrupt: kPORT_InterruptOrDMADisabled,
    pull_select: no_init}
  - {pin_num: '83', peripheral: GPIOC, signal: 'GPIO, 11', pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b, direction: INPUT, pull_select: no_init}
  - {pin_num: '84', peripheral: GPIOC, signal: 'GPIO, 12', pin_signal: PTC12/UART4_RTS_b/FB_AD27/FTM3_FLT0, direction: INPUT, pull_select: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : KIT_SW
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void KIT_SW(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t PTC9_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(SW_PTC9_GPIO, SW_PTC9_PIN, &PTC9_config);

    gpio_pin_config_t PTC10_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(SW_PTC10_GPIO, SW_PTC10_PIN, &PTC10_config);

    gpio_pin_config_t PTC11_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin 83)  */
    GPIO_PinInit(SW_PTC11_GPIO, SW_PTC11_PIN, &PTC11_config);

    gpio_pin_config_t PTC12_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 84)  */
    GPIO_PinInit(SW_PTC12_GPIO, SW_PTC12_PIN, &PTC12_config);

    /* PORTC10 (pin 82) is configured as PTC10 */
    PORT_SetPinMux(SW_PTC10_PORT, SW_PTC10_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC10 (pin 82): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(SW_PTC10_PORT, SW_PTC10_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTC11 (pin 83) is configured as PTC11 */
    PORT_SetPinMux(SW_PTC11_PORT, SW_PTC11_PIN, kPORT_MuxAsGpio);

    /* PORTC12 (pin 84) is configured as PTC12 */
    PORT_SetPinMux(SW_PTC12_PORT, SW_PTC12_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 81) is configured as PTC9 */
    PORT_SetPinMux(SW_PTC9_PORT, SW_PTC9_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC9 (pin 81): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(SW_PTC9_PORT, SW_PTC9_PIN, kPORT_InterruptOrDMADisabled);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
